000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийИнтернетЗаказа/КомментарийИнтернетЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарийИнтернетЗаказа</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусКомментария</name>
    <type>
      <types>EnumRef.СтатусыКомментария</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КомментарийИнтернетЗаказа/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Запись комментария.
// 
// Параметры:
//  ЗаказПокупателя - ДокументСсылка.ЗаказПокупателя, ДокументСсылка.ВозвратИнтернетЗаказа -  Заказ покупателя или 
//  	возврат интренет заказа
//  Автор - СправочникСсылка.Пользователи - Автор
//  Комментарий - Строка - Комментарий
Процедура ЗаписьКомментария(ЗаказПокупателя, Автор, Комментарий) Экспорт 
	
	Если ТипЗнч(Комментарий) = Тип("Соответствие") Тогда
		
		СтрокаКомментария = "";
		
		Для Каждого СтрокаСоответствия Из Комментарий Цикл
			
			СтрокаКомментария = СтрокаКомментария + СтрокаСоответствия.Ключ + ": " + СтрокаСоответствия.Значение + Символы.ПС;
			
		КонецЦикла;
		
	Иначе
		
		СтрокаКомментария = Комментарий;

	КонецЕсли;

	ДатаКомментария = ТекущаяДатаСеанса();
	НаборЗаписей = СоздатьНаборЗаписей();
		
	НаборЗаписей.Отбор.Автор.Установить(Автор);
	НаборЗаписей.Отбор.Период.Установить(ДатаКомментария);
	НаборЗаписей.Отбор.ЗаказПокупателя.Установить(ЗаказПокупателя);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда 
		
		ДобавляемыйКомментарий = СтрокаКомментария;  
		НоваяЗапись = НаборЗаписей.Добавить();
	
	Иначе 
		
		ДобавляемыйКомментарий = НаборЗаписей[0].Комментарий + Символы.ПС + СтрокаКомментария;
		НоваяЗапись = НаборЗаписей[0];
		
	КонецЕсли; 
	
	НоваяЗапись.Период = ДатаКомментария;
	НоваяЗапись.ЗаказПокупателя = ЗаказПокупателя;
	НоваяЗапись.Автор = Автор;
	НоваяЗапись.Комментарий = ДобавляемыйКомментарий;
	
	НаборЗаписей.Записать(Истина);

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
